# CHAPTER 07 - DATA CLEANING AND PREPARATION

## HANDILING MISSING DATA

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## FILTERING OUT MISSING DATA

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
data.dropna(inplace=True)

In [15]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned = data.dropna()

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4] = NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df = pd.DataFrame(np.random.randn(7,3))

In [25]:
df

          0         1         2
0 -0.849261  0.150816 -1.992587
1  1.012175 -2.010335 -1.891874
2  0.733418 -0.885510  0.585835
3  1.556497 -0.050829  1.710517
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

In [26]:
df.iloc[:4, 1] = NA

In [27]:
df

          0         1         2
0 -0.849261       NaN -1.992587
1  1.012175       NaN -1.891874
2  0.733418       NaN  0.585835
3  1.556497       NaN  1.710517
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

In [28]:
df.iloc[:2, 2] = NA

In [29]:
df

          0         1         2
0 -0.849261       NaN       NaN
1  1.012175       NaN       NaN
2  0.733418       NaN  0.585835
3  1.556497       NaN  1.710517
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

In [30]:
df.dropna()

          0         1         2
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

In [31]:
df.dropna(thresh=2)

          0         1         2
2  0.733418       NaN  0.585835
3  1.556497       NaN  1.710517
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

## FILLINING IN MISSING DATA

In [32]:
df.fillna(0)

          0         1         2
0 -0.849261  0.000000  0.000000
1  1.012175  0.000000  0.000000
2  0.733418  0.000000  0.585835
3  1.556497  0.000000  1.710517
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

In [33]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.849261  0.500000  0.000000
1  1.012175  0.500000  0.000000
2  0.733418  0.500000  0.585835
3  1.556497  0.500000  1.710517
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

In [34]:
_ = df.fillna(0, inplace=True)

In [35]:
df

          0         1         2
0 -0.849261  0.000000  0.000000
1  1.012175  0.000000  0.000000
2  0.733418  0.000000  0.585835
3  1.556497  0.000000  1.710517
4 -1.800774 -0.929989  0.038919
5 -0.714751  2.011386  0.213072
6  0.768366  1.632289 -0.829719

In [36]:
df = pd.DataFrame(np.random.randn(6, 3))

In [37]:
df

          0         1         2
0 -1.151199  2.081647  2.336207
1 -0.744824  1.075600  1.984325
2 -0.073457 -0.862827 -0.555314
3 -1.797327 -0.656244 -0.443001
4 -0.431046  0.259705  1.342550
5 -1.006129  0.492110  0.389123

In [38]:
df.iloc[2:, 1] = NA

In [39]:
df

          0         1         2
0 -1.151199  2.081647  2.336207
1 -0.744824  1.075600  1.984325
2 -0.073457       NaN -0.555314
3 -1.797327       NaN -0.443001
4 -0.431046       NaN  1.342550
5 -1.006129       NaN  0.389123

In [40]:
df.iloc[4:, 2] = NA

In [41]:
df

          0         1         2
0 -1.151199  2.081647  2.336207
1 -0.744824  1.075600  1.984325
2 -0.073457       NaN -0.555314
3 -1.797327       NaN -0.443001
4 -0.431046       NaN       NaN
5 -1.006129       NaN       NaN

In [42]:
df.fillna(method='ffill')

          0         1         2
0 -1.151199  2.081647  2.336207
1 -0.744824  1.075600  1.984325
2 -0.073457  1.075600 -0.555314
3 -1.797327  1.075600 -0.443001
4 -0.431046  1.075600 -0.443001
5 -1.006129  1.075600 -0.443001

In [43]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.151199  2.081647  2.336207
1 -0.744824  1.075600  1.984325
2 -0.073457  1.075600 -0.555314
3 -1.797327  1.075600 -0.443001
4 -0.431046       NaN -0.443001
5 -1.006129       NaN -0.443001

In [44]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [45]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## DATA TRANSFORMATION

In [46]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [47]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [50]:
data['v1'] = range(7)

In [51]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## TRANSFORMING DATA USING A FUNCTION OR MAPPING

In [89]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon',
                    'Pastrami', 'corned beef', 'Bacon',
                    'pastramin', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12,6, 7.5, 8,3, 5, 6]})

In [90]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6    pastramin     3.0
7    honey ham     5.0
8     nova lox     6.0

In [91]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [92]:
lowercased = data['food'].str.lower()

In [93]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6      pastramin
7      honey ham
8       nova lox
Name: food, dtype: object

In [94]:
data['animal'] = lowercased.map(meat_to_animal)

In [95]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6    pastramin     3.0     NaN
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [96]:
data['food'] = data['food'].map(lambda x: x.lower())

In [97]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6    pastramin     3.0     NaN
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## REPLACING VALUES

In [105]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [106]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [107]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [108]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [109]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [114]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [110]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [112]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## RENAMING AXIS INDEXES

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
        index=['Ohio', 'Colorado', 'New York'],
        columns=['one', 'two', 'three', 'four'])